In [48]:
import os
import json

In [59]:
#Aggregate Transactions

path1 = "C:/Users/admin/Desktop/PhonePe_project/PhonePe/pulse/data/aggregated/transaction/country/india/state/"
aggre_trans_list = os.listdir(path1)

#creating a dictionary for the columns to be named

column1 = {"States":[], "Year":[], "Quarter":[], "Trasaction_type":[], "Transaction_count":[], "Transaction_amount":[]}
#Creating for loop to access the location of folders inside the above path
for i in aggre_trans_list:
    current_state = path1+i+"/"
    aggre_year_list = os.listdir(current_state)
    #creating for loop to access the year inside the state folder
    for j in aggre_year_list:
        current_year = current_state+j+"/" 
        aggre_file_list = os.listdir(current_year)

        for k in aggre_file_list:
            current_file = current_year+k
            data = open(current_file,"r")

            read = json.load(data)

In [60]:
aggre_transaction_df

,States,Year,Quarterly,Transaction_type,Transaction_count,Transaction_amount
0,Andaman & Nicobar,2018,1,Recharge & bill payments,4200,1.845307e+06
1,Andaman & Nicobar,2018,1,Peer-to-peer payments,1871,1.213866e+07
2,Andaman & Nicobar,2018,1,Merchant payments,298,4.525072e+05
3,Andaman & Nicobar,2018,1,Financial Services,33,1.060142e+04
4,Andaman & Nicobar,2018,1,Others,256,1.846899e+05
...,...,...,...,...,...,...
4129,West Bengal,2023,3,Merchant payments,296965002,2.004404e+11
4130,West Bengal,2023,3,Peer-to-peer payments,271150280,8.310501e+11
4131,West Bengal,2023,3,Recharge & bill payments,63055684,3.920985e+10
4132,West Bengal,2023,3,Financial Services,389751,4.249856e+08
4133,West Bengal,2023,3,Others,532474,4.232851e+08

In [61]:
 #Aggregate User
path2 = "C:/Users/admin/Desktop/PhonePe_project/PhonePe/pulse/data/aggregated/user/country/india/state/"
aggre_user_list = os.listdir(path2)

column2 = {"States":[],"Year":[] ,"Quarterly":[], "Brands":[], "Transaction_count":[], "Percentage":[]} 

for i in aggre_user_list:
    current_state = path2+i+"/"
    user_year_list = os.listdir(current_state)

    for j in user_year_list:
        current_year = current_state+j+"/"
        user_file_list = os.listdir(current_year)

        for k in user_file_list:
            current_file = current_year+k
            data2 = open(current_file,"r")

            read2 = json.load(data2)
            #print(read2["data"]["usersByDevice"])

            try:

                for r2 in read2["data"]["usersByDevice"]:
                    brand = r2["brand"]
                    count = r2["count"]
                    percentage = r2["percentage"]
                    column2["Brands"].append(brand)
                    column2["Transaction_count"].append(count)
                    column2["Percentage"].append(percentage)
                    column2["States"].append(i)
                    column2["Year"].append(j)
                    column2["Quarterly"].append(int(k.strip(".json")))
                    
            except:
               # print(" User_By_Device has no value. ")        
               pass

            
aggre_user_list_df = pd.DataFrame(column2)
aggre_user_list_df["States"] = aggre_user_list_df["States"].str.replace("andaman-&-nicobar-islands","Andaman & Nicobar")
aggre_user_list_df["States"] = aggre_user_list_df["States"].str.replace("-"," ")
aggre_user_list_df["States"] = aggre_user_list_df["States"].str.title()
aggre_user_list_df['States'] = aggre_user_list_df['States'].str.replace("Dadra & Nagar Haveli & Daman & Diu", "Dadra and Nagar Haveli and Daman and Diu")

In [ ]:
aggre_user_list_df

In [63]:
# Map Transaction
path3 = "C:/Users/admin/Desktop/PhonePe_project/PhonePe/pulse/data/map/transaction/hover/country/india/state/"
map_trans_list = os.listdir(path3)

column3 = {"States":[], "Year":[], "Quarterly":[], "District_name":[], "Transaction_count":[], "Transaction_amount":[]}

for i in map_trans_list:
    current_state = path3+i+"/"
    map_year_list =os.listdir(current_state)

    for j in map_year_list:
        current_year = current_state+j+"/"
        map_file_list = os.listdir(current_year)

        for k in map_file_list:
            current_file = current_year+k
            data3=open(current_file,"r")

            read3 = json.load(data3)
            #print(read3)

            for r3 in read3["data"]["hoverDataList"]:
                name = r3["name"]
                count = r3["metric"][0]["count"]
                amount = r3["metric"][0]["amount"]
                column3["District_name"].append(name)
                column3["Transaction_count"].append(count)
                column3["Transaction_amount"].append(amount)
                column3["States"].append(i)
                column3["Year"].append(j)
                column3["Quarterly"].append(int(k.strip(".json")))
                               

map_trans_list_df = pd.DataFrame(column3)
map_trans_list_df["States"] = map_trans_list_df["States"].str.replace("andaman-&-nicobar-islands","Andaman & Nicobar")
map_trans_list_df["States"] = map_trans_list_df["States"].str.replace("-"," ")
map_trans_list_df["States"] = map_trans_list_df["States"].str.title()
map_trans_list_df['States'] = map_trans_list_df['States'].str.replace("Dadra & Nagar Haveli & Daman & Diu", "Dadra and Nagar Haveli and Daman and Diu")

In [ ]:
map_trans_list_df

In [65]:
#Map User

path4 ="C:/Users/admin/Desktop/PhonePe_project/PhonePe/pulse/data/map/user/hover/country/india/state/"
map_user_list = os.listdir(path4)


column4 = {"States":[], "Year":[], "Quarterly":[], "District_name":[], "Registered_users":[], "App_opens":[]}

for i in map_user_list:
    current_state = path4+i+"/"
    map_year_list = os.listdir(current_state)

    for j in map_year_list:
        current_year = current_state+j+"/"
        map_file_list = os.listdir(current_year)

        for k in map_file_list:
            current_file = current_year+k
            data4 = open(current_file,"r")

            read4 = json.load(data4)
            
            for r4 in read4["data"]["hoverData"].items():
                district_name = r4[0]
                registered_user = r4[1]["registeredUsers"]
                app_opens = r4[1]["appOpens"]
                column4["District_name"].append(district_name)
                column4["Registered_users"].append(registered_user)
                column4["App_opens"].append(app_opens)
                column4["States"].append(i)
                column4["Year"].append(j)
                column4["Quarterly"].append(int(k.strip(".json")))
                


map_user_list_df = pd.DataFrame(column4)  
map_user_list_df["States"] = map_user_list_df["States"].str.replace("andaman-&-nicobar-islands","Andaman & Nicobar")
map_user_list_df["States"] = map_user_list_df["States"].str.replace("-"," ")
map_user_list_df["States"] = map_user_list_df["States"].str.title()
map_user_list_df['States'] = map_user_list_df['States'].str.replace("Dadra & Nagar Haveli & Daman & Diu", "Dadra and Nagar Haveli and Daman and Diu")

In [ ]:
map_user_list_df

In [67]:
#Top Transaction

path5 = "C:/Users/admin/Desktop/PhonePe_project/PhonePe/pulse/data/top/transaction/country/india/state/"
top_trans_list = os.listdir(path5)

column5 = {"States":[], "Year":[], "Quarterly":[], "Pincodes":[], "Transaction_count":[], "Transaction_amount":[]}

for i in top_trans_list:
    current_state = path5+i+"/"
    top_year_list = os.listdir(current_state)

    for j in top_year_list:
        current_year = current_state+j+"/"
        top_file_list = os.listdir(current_year)

        for k in top_file_list:
            current_file = current_year+k
            data5 =open(current_file,"r")

            read5 = json.load(data5)

            for r5 in read5["data"]["pincodes"]:
                entity_name = r5["entityName"]
                transaction_count = r5["metric"]["count"]
                transaction_amount = r5["metric"]["amount"]
                column5["Pincodes"].append(entity_name)
                column5["Transaction_count"].append(transaction_count)
                column5["Transaction_amount"].append(transaction_amount)
                column5["States"].append(i)
                column5["Year"].append(j)
                column5["Quarterly"].append(int(k.strip(".json")))

top_trans_list_df =pd.DataFrame(column5)                
top_trans_list_df["States"] = top_trans_list_df["States"].str.replace("andaman-&-nicobar-islands","Andaman & Nicobar")
top_trans_list_df["States"] = top_trans_list_df["States"].str.replace("-"," ")
top_trans_list_df["States"] = top_trans_list_df["States"].str.title()
top_trans_list_df['States'] = top_trans_list_df['States'].str.replace("Dadra & Nagar Haveli & Daman & Diu", "Dadra and Nagar Haveli and Daman and Diu")

In [68]:
top_trans_list_df

,States,Year,Quarterly,Pincodes,Transaction_count,Transaction_amount
0,Andaman & Nicobar,2018,1,744101,1622,2.769298e+06
1,Andaman & Nicobar,2018,1,744103,1223,2.238042e+06
2,Andaman & Nicobar,2018,1,744102,969,3.519060e+06
3,Andaman & Nicobar,2018,1,744105,685,1.298561e+06
4,Andaman & Nicobar,2018,1,744104,340,1.039715e+06
...,...,...,...,...,...,...
8205,West Bengal,2023,3,700001,3536928,7.193522e+09
8206,West Bengal,2023,3,721301,3464729,4.871566e+09
8207,West Bengal,2023,3,700039,3405551,5.095825e+09
8208,West Bengal,2023,3,732125,3347165,5.353831e+09
8209,West Bengal,2023,3,700015,3304464,5.003674e+09

In [69]:
#Top user

path6 = "C:/Users/admin/Desktop/PhonePe_project/PhonePe/pulse/data/top/user/country/india/state/"
top_user_list = os.listdir(path6)

column6 = {"States":[], "Year":[], "Quarterly":[], "Pincodes":[], "Registered_users":[]}

for i in top_user_list:
    current_state = path6+i+"/"
    top_year_list = os.listdir(current_state)

    for j in top_year_list:
        current_year = current_state+j+"/"
        top_file_list = os.listdir(current_year)

        for k in top_file_list:
            current_file = current_year+k
            data6 =open(current_file,"r")

            read6 = json.load(data6)

            for r6 in read6["data"]["pincodes"]:
                name = r6["name"]
                registered_user = r6["registeredUsers"]
                column6["Pincodes"].append(name)               
                column6["Registered_users"].append(registered_user)
                column6["States"].append(i)
                column6["Year"].append(j)
                column6["Quarterly"].append(int(k.strip(".json")))

top_user_list_df = pd.DataFrame(column6)
top_user_list_df["States"] = top_user_list_df["States"].str.replace("andaman-&-nicobar-islands","Andaman & Nicobar")
top_user_list_df["States"] = top_user_list_df["States"].str.replace("-"," ")
top_user_list_df["States"] = top_user_list_df["States"].str.title()
top_user_list_df['States'] = top_user_list_df['States'].str.replace("Dadra & Nagar Haveli & Daman & Diu", "Dadra and Nagar Haveli and Daman and Diu")

In [70]:
top_user_list_df

                 States  Year  Quarterly Pincodes  Registered_users
0     Andaman & Nicobar  2018          1   744103              1608
1     Andaman & Nicobar  2018          1   744101              1108
2     Andaman & Nicobar  2018          1   744105              1075
3     Andaman & Nicobar  2018          1   744102              1006
4     Andaman & Nicobar  2018          1   744104               272
...                 ...   ...        ...      ...               ...
8206        West Bengal  2023          3   700015            122316
8207        West Bengal  2023          3   742304            119245
8208        West Bengal  2023          3   721101            118798
8209        West Bengal  2023          3   700150            114987
8210        West Bengal  2023          3   734006            113991

[8211 rows x 5 columns]

In [72]:
#Table Creation
mydb = mysql.connect(
    host = "localhost",
    user = "root",
    password = "mysql",
    database = "phonepe",
    port = "3306"
)

cursor = mydb.cursor()

#Aggregate Transactoion Table
drop_query1 = '''drop table if exists aggregated_transaction'''
cursor.execute(drop_query1)
mydb.commit()

query1 = '''create table if not exists aggregated_transaction(States varchar(40),Year int,Quarterly int,Transaction_type varchar(50),
                                                                Transaction_count bigint,Transaction_amount bigint)'''
cursor.execute(query1)
mydb.commit()

for index,row in aggre_transaction_df.iterrows():
    insert_query1 = '''insert into aggregated_transaction(States, Year, Quarterly, Transaction_type, Transaction_count, Transaction_amount)
                                       values(%s,%s,%s,%s,%s,%s)'''
    
    values =(row["States"],
             row["Year"],
             row["Quarterly"],
             row["Transaction_type"],
             row["Transaction_count"],
             row["Transaction_amount"]
             )
    cursor.execute(insert_query1,values)
    mydb.commit()
#Aggregated User Table
drop_query2= '''drop table if exists aggregated_user'''
cursor.execute(drop_query2)
mydb.commit()

query2 = '''create table if not exists aggregated_user(States varchar(40),Year int,Quarterly int,Brands varchar(50),
                                                                Transaction_count bigint,Percentage float)'''
cursor.execute(query2)
mydb.commit()

for index,row in aggre_user_list_df.iterrows():
    insert_query2 = '''insert into aggregated_user(States, Year, Quarterly, Brands, Transaction_count, Percentage)
                                       values(%s,%s,%s,%s,%s,%s)'''
    
    values =(row["States"],
             row["Year"],
             row["Quarterly"],
             row["Brands"],
             row["Transaction_count"],
             row["Percentage"]
             )
    cursor.execute(insert_query2,values)
    mydb.commit()

#Map Transaction Table
drop_query3= '''drop table if exists map_transaction'''
cursor.execute(drop_query3)
mydb.commit()

query3 = '''create table if not exists map_transaction(States varchar(40),Year int,Quarterly int,District_name varchar(50),
                                                                Transaction_count bigint,Transaction_amount float)'''
cursor.execute(query3)
mydb.commit()

for index,row in map_trans_list_df.iterrows():
    insert_query3 = '''insert into map_transaction(States, Year, Quarterly, District_name, Transaction_count, Transaction_amount)
                                       values(%s,%s,%s,%s,%s,%s)'''
    
    values =(row["States"],
             row["Year"],
             row["Quarterly"],
             row["District_name"],
             row["Transaction_count"],
             row["Transaction_amount"]
             )
    cursor.execute(insert_query3,values)
    mydb.commit()

#Map User Table

drop_query4= '''drop table if exists map_user'''
cursor.execute(drop_query4)
mydb.commit()

query4 = '''create table if not exists map_user(States varchar(40),Year int,Quarterly int,District_name varchar(50),
                                                                Registered_users bigint,App_opens bigint)'''
cursor.execute(query4)
mydb.commit()

for index,row in map_user_list_df.iterrows():
    insert_query4 = '''insert into map_user(States, Year, Quarterly, District_name, Registered_users, App_opens)
                                       values(%s,%s,%s,%s,%s,%s)'''
    
    values =(row["States"],
             row["Year"],
             row["Quarterly"],
             row["District_name"],
             row["Registered_users"],
             row["App_opens"]
             )
    cursor.execute(insert_query4,values)
    mydb.commit()

#Top Transaction Table

drop_query5= '''drop table if exists top_transaction'''
cursor.execute(drop_query5)
mydb.commit()

query5 = '''create table if not exists top_transaction(States varchar(40),Year int,Quarterly int,Pincodes bigint,
                                                                Transaction_count bigint,Transaction_amount float)'''
cursor.execute(query5)
mydb.commit()

for index,row in top_trans_list_df.iterrows():
    insert_query5 = '''insert into top_transaction(States, Year, Quarterly, Pincodes, Transaction_count, Transaction_amount)
                                       values(%s,%s,%s,%s,%s,%s)'''
    
    values =(row["States"],
             row["Year"],
             row["Quarterly"],
             row["Pincodes"],
             row["Transaction_count"],
             row["Transaction_amount"]
             )
    cursor.execute(insert_query5,values)
    mydb.commit()

#Top User Table

drop_query6= '''drop table if exists top_user'''
cursor.execute(drop_query6)
mydb.commit()


query6 = '''create table if not exists top_user(States varchar(40),Year int,Quarterly int,Pincodes bigint,
                                                                Registered_users bigint)'''
cursor.execute(query6)
mydb.commit()

for index,row in top_user_list_df.iterrows():
    insert_query6 = '''insert into top_user(States, Year, Quarterly, Pincodes, Registered_users)
                                       values(%s,%s,%s,%s,%s)'''
    
    values =(row["States"],
             row["Year"],
             row["Quarterly"],
             row["Pincodes"],
             row["Registered_users"]
             )
    cursor.execute(insert_query6,values)
    mydb.commit()

In [40]:
mydb = mysql.connect(
    host = "localhost",
    user = "root",
    password = "mysql",
    database = "phonepe",
    port = "3306"
)

cursor = mydb.cursor()

cursor.execute("select * from aggregated_transaction;")

table1 = cursor.fetchall()
mydb.commit()
Aggre_trans = pd.DataFrame(table1,columns = ("States", "Years", "Quarter", "Transaction_type", "Transaction_count", "Transaction_amount"))

In [41]:
Aggre_trans

,States,Years,Quarter,Transaction_type,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2018,1,Recharge & bill payments,4200,1845307
1,andaman-&-nicobar-islands,2018,1,Peer-to-peer payments,1871,12138655
2,andaman-&-nicobar-islands,2018,1,Merchant payments,298,452507
3,andaman-&-nicobar-islands,2018,1,Financial Services,33,10601
4,andaman-&-nicobar-islands,2018,1,Others,256,184690
...,...,...,...,...,...,...
12397,west-bengal,2023,3,Merchant payments,296965002,200440391406
12398,west-bengal,2023,3,Peer-to-peer payments,271150280,831050092805
12399,west-bengal,2023,3,Recharge & bill payments,63055684,39209851435
12400,west-bengal,2023,3,Financial Services,389751,424985591
12401,west-bengal,2023,3,Others,532474,423285145

In [42]:
#SQL Connection
mydb = mysql.connect(
    host = "localhost",
    user = "root",
    password = "mysql",
    database = "phonepe",
    port = "3306"
)

cursor = mydb.cursor()

#Aggregated Transaction
cursor.execute("select * from aggregated_transaction")
table1 = cursor.fetchall()
mydb.commit()
at_df = pd.DataFrame(table1,columns= ("States","Year","Quarterly","Transaction_type","Transaction_count","Transaction_amount"))


#Aggregated User
cursor.execute("select * from aggregated_user")
table2 = cursor.fetchall()
mydb.commit()
au_df = pd.DataFrame(table2,columns= ("States","Year","Quarterly","Brands","Transaction_count","Percentage"))


#Map Transaction
cursor.execute("select * from map_transaction")
table3 = cursor.fetchall()
mydb.commit()
mt_df = pd.DataFrame(table3,columns= ("States","Year","Quarterly","District_name","Transaction_count","Transaction_amount"))

#Map User
cursor.execute("select * from map_user")
table4 = cursor.fetchall()
mydb.commit()
mu_df = pd.DataFrame(table4,columns= ("States","Year","Quarterly","District_name","Registered_users","App_opens"))

#Top Transaction
cursor.execute("select * from top_transaction")
table5 = cursor.fetchall()
mydb.commit()
tt_df = pd.DataFrame(table5,columns= ("States","Year","Quarterly","Pincodes","Transaction_count","Transaction_amount"))

In [43]:
mydb = mysql.connect(
    host = "localhost",
    user = "root",
    password = "mysql",
    database = "phonepe",
    port = "3306"
)

cursor = mydb.cursor()

#Top User
cursor.execute("select * from top_user")
table6 = cursor.fetchall()
mydb.commit()
tu_df = pd.DataFrame(table6,columns= ("States","Year","Quarterly","Pincodes","Registered_users"))

In [44]:
tu_df

                          States  Year  Quarterly  Pincodes  Registered_users
0      andaman-&-nicobar-islands  2018          1    744103              1608
1      andaman-&-nicobar-islands  2018          1    744101              1108
2      andaman-&-nicobar-islands  2018          1    744105              1075
3      andaman-&-nicobar-islands  2018          1    744102              1006
4      andaman-&-nicobar-islands  2018          1    744104               272
...                          ...   ...        ...       ...               ...
24628                west-bengal  2023          3    700015            122316
24629                west-bengal  2023          3    742304            119245
24630                west-bengal  2023          3    721101            118798
24631                west-bengal  2023          3    700150            114987
24632                west-bengal  2023          3    734006            113991

[24633 rows x 5 columns]

In [49]:
#CREATE DATAFRAMES FROM SQL
#sql connection
mydb = mysql.connect(
    host = "localhost",
    user = "root",
    password = "mysql",
    database = "phonepe",
    port = "3306"
)
cursor = mydb.cursor()

#Aggregated_transsaction
cursor.execute("select * from aggregated_transaction;")

table1 = cursor.fetchall()
mydb.commit()
Aggre_trans = pd.DataFrame(table1,columns = ("States", "Years", "Quarter", "Transaction_type", "Transaction_count", "Transaction_amount"))

#Aggregated_user
cursor.execute("select * from aggregated_user")

table2 = cursor.fetchall()
mydb.commit()
Aggre_user = pd.DataFrame(table2,columns = ("States", "Years", "Quarter", "Brands", "Transaction_count", "Percentage"))

#Map_transaction
cursor.execute("select * from map_transaction")

table3 = cursor.fetchall()
mydb.commit()
Map_trans = pd.DataFrame(table3,columns = ("States", "Years", "Quarter", "Districts", "Transaction_count", "Transaction_amount"))

#Map_user
cursor.execute("select * from map_user")

table4 = cursor.fetchall()
mydb.commit()
Map_user = pd.DataFrame(table4,columns = ("States", "Years", "Quarter", "Districts", "RegisteredUser", "AppOpens"))

#Top_transaction
cursor.execute("select * from top_transaction")

table5 = cursor.fetchall()
mydb.commit()
Top_trans = pd.DataFrame(table5,columns = ("States", "Years", "Quarter", "Pincodes", "Transaction_count", "Transaction_amount"))

#Top_user
cursor.execute("select * from top_user")

table6 = cursor.fetchall()
mydb.commit()
Top_user = pd.DataFrame(table6, columns = ("States", "Years", "Quarter", "Pincodes", "RegisteredUser"))

In [50]:
Top_user

                          States  Years  Quarter  Pincodes  RegisteredUser
0      andaman-&-nicobar-islands   2018        1    744103            1608
1      andaman-&-nicobar-islands   2018        1    744101            1108
2      andaman-&-nicobar-islands   2018        1    744105            1075
3      andaman-&-nicobar-islands   2018        1    744102            1006
4      andaman-&-nicobar-islands   2018        1    744104             272
...                          ...    ...      ...       ...             ...
24628                west-bengal   2023        3    700015          122316
24629                west-bengal   2023        3    742304          119245
24630                west-bengal   2023        3    721101          118798
24631                west-bengal   2023        3    700150          114987
24632                west-bengal   2023        3    734006          113991

[24633 rows x 5 columns]

In [58]:
#def animate_all_amount():
url = "https://gist.githubusercontent.com/jbrobst/56c13bbbf9d97d187fea01ca62ea5112/raw/e388c4cae20aa53cb5090210a42ebb9b765c0a36/india_states.geojson"
response =requests.get(url)
data1 = json.loads(response.content)
state_names_tra = [feature["properties"]["ST_NM"] for feature in data1["features"]]
state_names_tra.sort()

df_state_names_tra = pd.DataFrame({"States":state_names_tra})

frames = []

for year in Map_user["Years"].unique():
    for quarter in Aggre_trans["Quarter"].unique():

        at1 = Aggre_trans[(Aggre_trans["Years"]==year)&(Aggre_trans["Quarter"]==quarter)]
        atf1 = at1[["States","Transaction_amount"]]
        atf1 = atf1.sort_values(by="States")
        atf1["Years"]=year
        atf1["Quarter"]=quarter
        frames.append(atf1)

merged_df = pd.concat(frames)


fig_tra = px.choropleth(merged_df, geojson= 'https://gist.githubusercontent.com/jbrobst/56c13bbbf9d97d187fea01ca62ea5112/raw/e388c4cae20aa53cb5090210a42ebb9b765c0a36/india_states.geojson', locations= "States", featureidkey= "properties.ST_NM", color= "Transaction_amount",
                        color_continuous_scale= "Sunsetdark", range_color= (0,4000000000), hover_name= "States", title = "TRANSACTION AMOUNT",
                        animation_frame="Years", animation_group="Quarter")

fig_tra.update_geos(fitbounds= "locations", visible =False)
fig_tra.update_layout(width =600, height= 700)
fig_tra.update_layout(title_font= {"size":25})
# return st.map(fig_tra)
st.plotly_chart(fig_tra,use_container_width=True)

DeltaGenerator()